Documents/СписаниеМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>СписаниеМатериалов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СтоимостьТоваровПоФакту</xr:Item>
				<xr:Item>AccountingRegister.РегистрБухгалтерии</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЮрЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетСписания</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ПланСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПриобретения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.ПланСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccountingRegisters/РегистрБухгалтерии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccountingRegister>
		<Properties>
			<Name>РегистрБухгалтерии</Name>
			<ChartOfAccounts>ChartOfAccounts.ПланСчетов</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ЮрЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрЛица</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ПланСчетов.ExtDimensionAccountingFlag.СуммовойУчет</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ПланСчетов.AccountingFlag.КоличественныйУчет</AccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СодержаниеПроводки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

AccumulationRegisters/СтоимостьТоваровПоФакту.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<AccumulationRegister>
		<Properties>
			<Name>СтоимостьТоваровПоФакту</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЮрЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/УчетСтоимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>УчетСтоимости</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Себестоимость</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФИФО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Средневзвешенное</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/СписаниеМатериалов/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.РегистрБухгалтерии.Записывать = Истина;
	
#Область СебестоимостьПоСтоимости	
	Если ЮрЛицо.УчетСтоимости = Перечисления.УчетСтоимости.Себестоимость Тогда
		
		// Проверка наличия на складе
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		Запрос.Текст = "ВЫБРАТЬ
		|	Номенклатура,
		|	ЦенаПриобретения КАК ЦенаПриобретения,
		|	Количество КАК Количество,
		|	Сумма КАК Сумма
		|ПОМЕСТИТЬ ДокТЧ
		|ИЗ
		|	Документ.СписаниеМатериалов.Материалы КАК СписаниеМатериаловМатериалы
		|ГДЕ
		|	Ссылка = &Ссылка
		|;
		|ВЫБРАТЬ * ИЗ ДокТЧ";
		
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Движения.СтоимостьТоваровПоФакту.Записывать = Истина;
		
		Пока Выборка.Следующий() Цикл
			Движение = Движения.СтоимостьТоваровПоФакту.ДобавитьРасход();
			Движение.Период = Дата;
			Движение.ЮрЛицо = ЮрЛицо;
			Движение.Номенклатура = Выборка.Номенклатура;
			Движение.Цена = Выборка.ЦенаПриобретения;
			Движение.Склад = Склад;
			Движение.Количество = Выборка.Количество;
			Движение.Стоимость = Выборка.Сумма;
		КонецЦикла;
		
		Движения.СтоимостьТоваровПоФакту.БлокироватьДляИзменения = Истина;
		Движения.Записать();
		
		Запрос.Текст = "ВЫБРАТЬ
		|  ОстаткиТоваровОстатки.Номенклатура,
		|  ОстаткиТоваровОстатки.Цена,
		|  ОстаткиТоваровОстатки.КоличествоОстаток
		|ИЗ
		|  РегистрНакопления.СтоимостьТоваровПоФакту.Остатки(&ВремяОстатков, Склад = &Склад
		|    И ЮрЛицо = &ЮрЛицо И Номенклатура В
		|      (ВЫБРАТЬ 
		|		  ДокТЧ.Номенклатура
		|       ИЗ
		|         ДокТЧ КАК ДокТЧ)) КАК ОстаткиТоваровОстатки
		|ГДЕ
		|  ОстаткиТоваровОстатки.КоличествоОстаток < 0";
		
		
		// Условие по времени, чтобы выбирались остатки после проведения документа. 
		
		Граница = Новый Граница(МоментВремени(),ВидГраницы.Включая);
		Запрос.УстановитьПараметр("ВремяОстатков", Граница);
		Запрос.УстановитьПараметр("Склад", Склад);
		Запрос.УстановитьПараметр("ЮрЛицо", ЮрЛицо);
		
		
		РезультатЗапроса = Запрос.Выполнить();
		
		// Сообщим, чего не хватает
		Если НЕ ЮрЛицо.УходВМинус И НЕ РезультатЗапроса.Пустой() Тогда 
			
			Отказ = Истина;
			
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				Сообщить("Мало товара " + Выборка.Номенклатура + " с ценой покупки " + Выборка.Цена + ", нужно ещё " + (-Выборка.КоличествоОстаток));
			КонецЦикла
			
		КонецЕсли;
		
		// Если не хватает товара, прекращаем проведение
		Если Отказ Тогда 
			Возврат;
		КонецЕсли;
		
		Для каждого СТР Из Материалы Цикл
			
			Проводка = Движения.РегистрБухгалтерии.Добавить();
			Проводка.Период = Дата;
			Проводка.ЮрЛицо = ЮрЛицо;
			Проводка.СчетДт = СчетСписания;
			Проводка.СчетКт = СТР.СчетУчета;
			Проводка.Сумма = СТР.Сумма;
			Проводка.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = СТР.Номенклатура;
			Проводка.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Склады] = Склад;
			Проводка.КоличествоКт = СТР.Количество;
		
		КонецЦикла;

		
	КонецЕсли;
#КонецОбласти

	Движения.РегистрБухгалтерии.Записывать = Истина;
	
КонецПроцедуры
